{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 8], "name": "input_446", "sparse": false}, "inbound_nodes": [], "name": "input_446"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 1], "name": "input_447", "sparse": false}, "inbound_nodes": [], "name": "input_447"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_268"}, "inbound_nodes": [[["input_446", 0, 0, {}], ["input_447", 0, 0, {}]]], "name": "masked_dense_layer_268"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_269"}, "inbound_nodes": [[["masked_dense_layer_268", 0, 0, {}], ["input_447", 0, 0, {}]]], "name": "masked_dense_layer_269"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_270"}, "inbound_nodes": [[["masked_dense_layer_269", 0, 0, {}], ["input_447", 0, 0, {}]]], "name": "masked_dense_layer_270"}], "input_layers": [["input_446", 0, 0], ["input_447", 0, 0]], "output_layers": [["masked_dense_layer_270", 0, 0]], "name": "model_90"}, "backend": "tensorflow"}