{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_37", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "input_37"}, "inbound_nodes": []}, {"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784, 2000], "dtype": "float32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "masked_dense_layer_28", "class_name": "MaskedDenseLayer", "config": {"name": "masked_dense_layer_28", "trainable": true}, "inbound_nodes": [[["input_37", 0, 0, {}], ["input_38", 0, 0, {}]]]}, {"name": "input_39", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2000, 2000], "dtype": "float32", "sparse": false, "name": "input_39"}, "inbound_nodes": []}, {"name": "masked_dense_layer_29", "class_name": "MaskedDenseLayer", "config": {"name": "masked_dense_layer_29", "trainable": true}, "inbound_nodes": [[["masked_dense_layer_28", 0, 0, {}], ["input_39", 0, 0, {}]]]}, {"name": "input_40", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2000, 784], "dtype": "float32", "sparse": false, "name": "input_40"}, "inbound_nodes": []}, {"name": "masked_dense_layer_30", "class_name": "MaskedDenseLayer", "config": {"name": "masked_dense_layer_30", "trainable": true}, "inbound_nodes": [[["masked_dense_layer_29", 0, 0, {}], ["input_40", 0, 0, {}]]]}], "input_layers": [["input_37", 0, 0], ["input_38", 0, 0], ["input_39", 0, 0], ["input_40", 0, 0]], "output_layers": [["masked_dense_layer_30", 0, 0]]}, "keras_version": "2.0.9", "backend": "tensorflow"}