{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float64", "batch_input_shape": [null, 784], "name": "input_649", "sparse": false}, "inbound_nodes": [], "name": "input_649"}, {"class_name": "InputLayer", "config": {"dtype": "float64", "batch_input_shape": [null, 784, 10], "name": "input_650", "sparse": false}, "inbound_nodes": [], "name": "input_650"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_488"}, "inbound_nodes": [[["input_649", 0, 0, {}], ["input_650", 0, 0, {}]]], "name": "masked_dense_layer_488"}, {"class_name": "InputLayer", "config": {"dtype": "float64", "batch_input_shape": [null, 10, 10], "name": "input_651", "sparse": false}, "inbound_nodes": [], "name": "input_651"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_489"}, "inbound_nodes": [[["masked_dense_layer_488", 0, 0, {}], ["input_651", 0, 0, {}]]], "name": "masked_dense_layer_489"}, {"class_name": "InputLayer", "config": {"dtype": "float64", "batch_input_shape": [null, 10, 784], "name": "input_652", "sparse": false}, "inbound_nodes": [], "name": "input_652"}, {"class_name": "MaskedDenseLayer", "config": {"trainable": true, "name": "masked_dense_layer_490"}, "inbound_nodes": [[["masked_dense_layer_489", 0, 0, {}], ["input_652", 0, 0, {}]]], "name": "masked_dense_layer_490"}], "input_layers": [["input_649", 0, 0], ["input_650", 0, 0], ["input_651", 0, 0], ["input_652", 0, 0]], "output_layers": [["masked_dense_layer_490", 0, 0]], "name": "model_162"}, "backend": "tensorflow"}